Microchip-MPLAB-Harmony/csp/apps/trustZone/systick/NonSecure/firmware/src/packs/ATSAML11E16A_DFP/component/pac.h
/* -------- PAC_NONSECA : (PAC Offset: 0x54) ( R/ 32) Peripheral non-secure status - Bridge A -------- */
#define PAC_NONSECA_RESETVALUE                _U_(0x00)                                            /**<  (PAC_NONSECA) Peripheral non-secure status - Bridge A  Reset Value */

#define PAC_NONSECA_PAC_Pos                   _U_(0)                                               /**< (PAC_NONSECA) PAC Non-Secure Position */
#define PAC_NONSECA_PAC_Msk                   (_U_(0x1) << PAC_NONSECA_PAC_Pos)                    /**< (PAC_NONSECA) PAC Non-Secure Mask */
#define PAC_NONSECA_PAC(value)                (PAC_NONSECA_PAC_Msk & ((value) << PAC_NONSECA_PAC_Pos))
#define PAC_NONSECA_PM_Pos                    _U_(1)                                               /**< (PAC_NONSECA) PM Non-Secure Position */
#define PAC_NONSECA_PM_Msk                    (_U_(0x1) << PAC_NONSECA_PM_Pos)                     /**< (PAC_NONSECA) PM Non-Secure Mask */
#define PAC_NONSECA_PM(value)                 (PAC_NONSECA_PM_Msk & ((value) << PAC_NONSECA_PM_Pos))
#define PAC_NONSECA_MCLK_Pos                  _U_(2)                                               /**< (PAC_NONSECA) MCLK Non-Secure Position */
#define PAC_NONSECA_MCLK_Msk                  (_U_(0x1) << PAC_NONSECA_MCLK_Pos)                   /**< (PAC_NONSECA) MCLK Non-Secure Mask */
#define PAC_NONSECA_MCLK(value)               (PAC_NONSECA_MCLK_Msk & ((value) << PAC_NONSECA_MCLK_Pos))
#define PAC_NONSECA_RSTC_Pos                  _U_(3)                                               /**< (PAC_NONSECA) RSTC Non-Secure Position */
#define PAC_NONSECA_RSTC_Msk                  (_U_(0x1) << PAC_NONSECA_RSTC_Pos)                   /**< (PAC_NONSECA) RSTC Non-Secure Mask */
#define PAC_NONSECA_RSTC(value)               (PAC_NONSECA_RSTC_Msk & ((value) << PAC_NONSECA_RSTC_Pos))
#define PAC_NONSECA_OSCCTRL_Pos               _U_(4)                                               /**< (PAC_NONSECA) OSCCTRL Non-Secure Position */
#define PAC_NONSECA_OSCCTRL_Msk               (_U_(0x1) << PAC_NONSECA_OSCCTRL_Pos)                /**< (PAC_NONSECA) OSCCTRL Non-Secure Mask */
#define PAC_NONSECA_OSCCTRL(value)            (PAC_NONSECA_OSCCTRL_Msk & ((value) << PAC_NONSECA_OSCCTRL_Pos))
#define PAC_NONSECA_OSC32KCTRL_Pos            _U_(5)                                               /**< (PAC_NONSECA) OSC32KCTRL Non-Secure Position */
#define PAC_NONSECA_OSC32KCTRL_Msk            (_U_(0x1) << PAC_NONSECA_OSC32KCTRL_Pos)             /**< (PAC_NONSECA) OSC32KCTRL Non-Secure Mask */
#define PAC_NONSECA_OSC32KCTRL(value)         (PAC_NONSECA_OSC32KCTRL_Msk & ((value) << PAC_NONSECA_OSC32KCTRL_Pos))
#define PAC_NONSECA_SUPC_Pos                  _U_(6)                                               /**< (PAC_NONSECA) SUPC Non-Secure Position */
#define PAC_NONSECA_SUPC_Msk                  (_U_(0x1) << PAC_NONSECA_SUPC_Pos)                   /**< (PAC_NONSECA) SUPC Non-Secure Mask */
#define PAC_NONSECA_SUPC(value)               (PAC_NONSECA_SUPC_Msk & ((value) << PAC_NONSECA_SUPC_Pos))
#define PAC_NONSECA_GCLK_Pos                  _U_(7)                                               /**< (PAC_NONSECA) GCLK Non-Secure Position */
#define PAC_NONSECA_GCLK_Msk                  (_U_(0x1) << PAC_NONSECA_GCLK_Pos)                   /**< (PAC_NONSECA) GCLK Non-Secure Mask */
#define PAC_NONSECA_GCLK(value)               (PAC_NONSECA_GCLK_Msk & ((value) << PAC_NONSECA_GCLK_Pos))
#define PAC_NONSECA_WDT_Pos                   _U_(8)                                               /**< (PAC_NONSECA) WDT Non-Secure Position */
#define PAC_NONSECA_WDT_Msk                   (_U_(0x1) << PAC_NONSECA_WDT_Pos)                    /**< (PAC_NONSECA) WDT Non-Secure Mask */
#define PAC_NONSECA_WDT(value)                (PAC_NONSECA_WDT_Msk & ((value) << PAC_NONSECA_WDT_Pos))
#define PAC_NONSECA_RTC_Pos                   _U_(9)                                               /**< (PAC_NONSECA) RTC Non-Secure Position */
#define PAC_NONSECA_RTC_Msk                   (_U_(0x1) << PAC_NONSECA_RTC_Pos)                    /**< (PAC_NONSECA) RTC Non-Secure Mask */
#define PAC_NONSECA_RTC(value)                (PAC_NONSECA_RTC_Msk & ((value) << PAC_NONSECA_RTC_Pos))
#define PAC_NONSECA_EIC_Pos                   _U_(10)                                              /**< (PAC_NONSECA) EIC Non-Secure Position */
#define PAC_NONSECA_EIC_Msk                   (_U_(0x1) << PAC_NONSECA_EIC_Pos)                    /**< (PAC_NONSECA) EIC Non-Secure Mask */
#define PAC_NONSECA_EIC(value)                (PAC_NONSECA_EIC_Msk & ((value) << PAC_NONSECA_EIC_Pos))
#define PAC_NONSECA_FREQM_Pos                 _U_(11)                                              /**< (PAC_NONSECA) FREQM Non-Secure Position */
#define PAC_NONSECA_FREQM_Msk                 (_U_(0x1) << PAC_NONSECA_FREQM_Pos)                  /**< (PAC_NONSECA) FREQM Non-Secure Mask */
#define PAC_NONSECA_FREQM(value)              (PAC_NONSECA_FREQM_Msk & ((value) << PAC_NONSECA_FREQM_Pos))
#define PAC_NONSECA_PORT_Pos                  _U_(12)                                              /**< (PAC_NONSECA) PORT Non-Secure Position */
#define PAC_NONSECA_PORT_Msk                  (_U_(0x1) << PAC_NONSECA_PORT_Pos)                   /**< (PAC_NONSECA) PORT Non-Secure Mask */
#define PAC_NONSECA_PORT(value)               (PAC_NONSECA_PORT_Msk & ((value) << PAC_NONSECA_PORT_Pos))
#define PAC_NONSECA_AC_Pos                    _U_(13)                                              /**< (PAC_NONSECA) AC Non-Secure Position */
#define PAC_NONSECA_AC_Msk                    (_U_(0x1) << PAC_NONSECA_AC_Pos)                     /**< (PAC_NONSECA) AC Non-Secure Mask */
#define PAC_NONSECA_AC(value)                 (PAC_NONSECA_AC_Msk & ((value) << PAC_NONSECA_AC_Pos))
#define PAC_NONSECA_Msk                       _U_(0x00003FFF)                                      /**< (PAC_NONSECA) Register Mask  */


/* -------- PAC_NONSECB : (PAC Offset: 0x58) ( R/ 32) Peripheral non-secure status - Bridge B -------- */
#define PAC_NONSECB_RESETVALUE                _U_(0x02)                                            /**<  (PAC_NONSECB) Peripheral non-secure status - Bridge B  Reset Value */

#define PAC_NONSECB_IDAU_Pos                  _U_(0)                                               /**< (PAC_NONSECB) IDAU Non-Secure Position */
#define PAC_NONSECB_IDAU_Msk                  (_U_(0x1) << PAC_NONSECB_IDAU_Pos)                   /**< (PAC_NONSECB) IDAU Non-Secure Mask */
#define PAC_NONSECB_IDAU(value)               (PAC_NONSECB_IDAU_Msk & ((value) << PAC_NONSECB_IDAU_Pos))
#define PAC_NONSECB_DSU_Pos                   _U_(1)                                               /**< (PAC_NONSECB) DSU Non-Secure Position */
#define PAC_NONSECB_DSU_Msk                   (_U_(0x1) << PAC_NONSECB_DSU_Pos)                    /**< (PAC_NONSECB) DSU Non-Secure Mask */
#define PAC_NONSECB_DSU(value)                (PAC_NONSECB_DSU_Msk & ((value) << PAC_NONSECB_DSU_Pos))
#define PAC_NONSECB_NVMCTRL_Pos               _U_(2)                                               /**< (PAC_NONSECB) NVMCTRL Non-Secure Position */
#define PAC_NONSECB_NVMCTRL_Msk               (_U_(0x1) << PAC_NONSECB_NVMCTRL_Pos)                /**< (PAC_NONSECB) NVMCTRL Non-Secure Mask */
#define PAC_NONSECB_NVMCTRL(value)            (PAC_NONSECB_NVMCTRL_Msk & ((value) << PAC_NONSECB_NVMCTRL_Pos))
#define PAC_NONSECB_DMAC_Pos                  _U_(3)                                               /**< (PAC_NONSECB) DMAC Non-Secure Position */
#define PAC_NONSECB_DMAC_Msk                  (_U_(0x1) << PAC_NONSECB_DMAC_Pos)                   /**< (PAC_NONSECB) DMAC Non-Secure Mask */
#define PAC_NONSECB_DMAC(value)               (PAC_NONSECB_DMAC_Msk & ((value) << PAC_NONSECB_DMAC_Pos))
#define PAC_NONSECB_Msk                       _U_(0x0000000F)                                      /**< (PAC_NONSECB) Register Mask  */


/* -------- PAC_NONSECC : (PAC Offset: 0x5C) ( R/ 32) Peripheral non-secure status - Bridge C -------- */
#define PAC_NONSECC_RESETVALUE                _U_(0x00)                                            /**<  (PAC_NONSECC) Peripheral non-secure status - Bridge C  Reset Value */

#define PAC_NONSECC_EVSYS_Pos                 _U_(0)                                               /**< (PAC_NONSECC) EVSYS Non-Secure Position */
#define PAC_NONSECC_EVSYS_Msk                 (_U_(0x1) << PAC_NONSECC_EVSYS_Pos)                  /**< (PAC_NONSECC) EVSYS Non-Secure Mask */
#define PAC_NONSECC_EVSYS(value)              (PAC_NONSECC_EVSYS_Msk & ((value) << PAC_NONSECC_EVSYS_Pos))
#define PAC_NONSECC_SERCOM0_Pos               _U_(1)                                               /**< (PAC_NONSECC) SERCOM0 Non-Secure Position */
#define PAC_NONSECC_SERCOM0_Msk               (_U_(0x1) << PAC_NONSECC_SERCOM0_Pos)                /**< (PAC_NONSECC) SERCOM0 Non-Secure Mask */
#define PAC_NONSECC_SERCOM0(value)            (PAC_NONSECC_SERCOM0_Msk & ((value) << PAC_NONSECC_SERCOM0_Pos))
#define PAC_NONSECC_SERCOM1_Pos               _U_(2)                                               /**< (PAC_NONSECC) SERCOM1 Non-Secure Position */
#define PAC_NONSECC_SERCOM1_Msk               (_U_(0x1) << PAC_NONSECC_SERCOM1_Pos)                /**< (PAC_NONSECC) SERCOM1 Non-Secure Mask */
#define PAC_NONSECC_SERCOM1(value)            (PAC_NONSECC_SERCOM1_Msk & ((value) << PAC_NONSECC_SERCOM1_Pos))
#define PAC_NONSECC_SERCOM2_Pos               _U_(3)                                               /**< (PAC_NONSECC) SERCOM2 Non-Secure Position */
#define PAC_NONSECC_SERCOM2_Msk               (_U_(0x1) << PAC_NONSECC_SERCOM2_Pos)                /**< (PAC_NONSECC) SERCOM2 Non-Secure Mask */
#define PAC_NONSECC_SERCOM2(value)            (PAC_NONSECC_SERCOM2_Msk & ((value) << PAC_NONSECC_SERCOM2_Pos))
#define PAC_NONSECC_TC0_Pos                   _U_(4)                                               /**< (PAC_NONSECC) TC0 Non-Secure Position */
#define PAC_NONSECC_TC0_Msk                   (_U_(0x1) << PAC_NONSECC_TC0_Pos)                    /**< (PAC_NONSECC) TC0 Non-Secure Mask */
#define PAC_NONSECC_TC0(value)                (PAC_NONSECC_TC0_Msk & ((value) << PAC_NONSECC_TC0_Pos))
#define PAC_NONSECC_TC1_Pos                   _U_(5)                                               /**< (PAC_NONSECC) TC1 Non-Secure Position */
#define PAC_NONSECC_TC1_Msk                   (_U_(0x1) << PAC_NONSECC_TC1_Pos)                    /**< (PAC_NONSECC) TC1 Non-Secure Mask */
#define PAC_NONSECC_TC1(value)                (PAC_NONSECC_TC1_Msk & ((value) << PAC_NONSECC_TC1_Pos))
#define PAC_NONSECC_TC2_Pos                   _U_(6)                                               /**< (PAC_NONSECC) TC2 Non-Secure Position */
#define PAC_NONSECC_TC2_Msk                   (_U_(0x1) << PAC_NONSECC_TC2_Pos)                    /**< (PAC_NONSECC) TC2 Non-Secure Mask */
#define PAC_NONSECC_TC2(value)                (PAC_NONSECC_TC2_Msk & ((value) << PAC_NONSECC_TC2_Pos))
#define PAC_NONSECC_ADC_Pos                   _U_(7)                                               /**< (PAC_NONSECC) ADC Non-Secure Position */
#define PAC_NONSECC_ADC_Msk                   (_U_(0x1) << PAC_NONSECC_ADC_Pos)                    /**< (PAC_NONSECC) ADC Non-Secure Mask */
#define PAC_NONSECC_ADC(value)                (PAC_NONSECC_ADC_Msk & ((value) << PAC_NONSECC_ADC_Pos))
#define PAC_NONSECC_DAC_Pos                   _U_(8)                                               /**< (PAC_NONSECC) DAC Non-Secure Position */
#define PAC_NONSECC_DAC_Msk                   (_U_(0x1) << PAC_NONSECC_DAC_Pos)                    /**< (PAC_NONSECC) DAC Non-Secure Mask */
#define PAC_NONSECC_DAC(value)                (PAC_NONSECC_DAC_Msk & ((value) << PAC_NONSECC_DAC_Pos))
#define PAC_NONSECC_PTC_Pos                   _U_(9)                                               /**< (PAC_NONSECC) PTC Non-Secure Position */
#define PAC_NONSECC_PTC_Msk                   (_U_(0x1) << PAC_NONSECC_PTC_Pos)                    /**< (PAC_NONSECC) PTC Non-Secure Mask */
#define PAC_NONSECC_PTC(value)                (PAC_NONSECC_PTC_Msk & ((value) << PAC_NONSECC_PTC_Pos))
#define PAC_NONSECC_TRNG_Pos                  _U_(10)                                              /**< (PAC_NONSECC) TRNG Non-Secure Position */
#define PAC_NONSECC_TRNG_Msk                  (_U_(0x1) << PAC_NONSECC_TRNG_Pos)                   /**< (PAC_NONSECC) TRNG Non-Secure Mask */
#define PAC_NONSECC_TRNG(value)               (PAC_NONSECC_TRNG_Msk & ((value) << PAC_NONSECC_TRNG_Pos))
#define PAC_NONSECC_CCL_Pos                   _U_(11)                                              /**< (PAC_NONSECC) CCL Non-Secure Position */
#define PAC_NONSECC_CCL_Msk                   (_U_(0x1) << PAC_NONSECC_CCL_Pos)                    /**< (PAC_NONSECC) CCL Non-Secure Mask */
#define PAC_NONSECC_CCL(value)                (PAC_NONSECC_CCL_Msk & ((value) << PAC_NONSECC_CCL_Pos))
#define PAC_NONSECC_OPAMP_Pos                 _U_(12)                                              /**< (PAC_NONSECC) OPAMP Non-Secure Position */
#define PAC_NONSECC_OPAMP_Msk                 (_U_(0x1) << PAC_NONSECC_OPAMP_Pos)                  /**< (PAC_NONSECC) OPAMP Non-Secure Mask */
#define PAC_NONSECC_OPAMP(value)              (PAC_NONSECC_OPAMP_Msk & ((value) << PAC_NONSECC_OPAMP_Pos))
#define PAC_NONSECC_TRAM_Pos                  _U_(13)                                              /**< (PAC_NONSECC) TRAM Non-Secure Position */
#define PAC_NONSECC_TRAM_Msk                  (_U_(0x1) << PAC_NONSECC_TRAM_Pos)                   /**< (PAC_NONSECC) TRAM Non-Secure Mask */
#define PAC_NONSECC_TRAM(value)               (PAC_NONSECC_TRAM_Msk & ((value) << PAC_NONSECC_TRAM_Pos))
#define PAC_NONSECC_Msk                       _U_(0x00003FFF)                                      /**< (PAC_NONSECC) Register Mask  */

#define PAC_NONSECC_SERCOM_Pos                _U_(1)                                               /**< (PAC_NONSECC Position) SERCOMx Non-Secure */
#define PAC_NONSECC_SERCOM_Msk                (_U_(0x7) << PAC_NONSECC_SERCOM_Pos)                 /**< (PAC_NONSECC Mask) SERCOM */
#define PAC_NONSECC_SERCOM(value)             (PAC_NONSECC_SERCOM_Msk & ((value) << PAC_NONSECC_SERCOM_Pos)) 
#define PAC_NONSECC_TC_Pos                    _U_(4)                                               /**< (PAC_NONSECC Position) TCx Non-Secure */
#define PAC_NONSECC_TC_Msk                    (_U_(0x7) << PAC_NONSECC_TC_Pos)                     /**< (PAC_NONSECC Mask) TC */
#define PAC_NONSECC_TC(value)                 (PAC_NONSECC_TC_Msk & ((value) << PAC_NONSECC_TC_Pos)) 

/** \brief PAC register offsets definitions */
#define PAC_WRCTRL_REG_OFST            (0x00)              /**< (PAC_WRCTRL) Write control Offset */
#define PAC_EVCTRL_REG_OFST            (0x04)              /**< (PAC_EVCTRL) Event control Offset */
#define PAC_INTENCLR_REG_OFST          (0x08)              /**< (PAC_INTENCLR) Interrupt enable clear Offset */
#define PAC_INTENSET_REG_OFST          (0x09)              /**< (PAC_INTENSET) Interrupt enable set Offset */
#define PAC_INTFLAGAHB_REG_OFST        (0x10)              /**< (PAC_INTFLAGAHB) Bridge interrupt flag status Offset */
#define PAC_INTFLAGA_REG_OFST          (0x14)              /**< (PAC_INTFLAGA) Peripheral interrupt flag status - Bridge A Offset */
#define PAC_INTFLAGB_REG_OFST          (0x18)              /**< (PAC_INTFLAGB) Peripheral interrupt flag status - Bridge B Offset */
#define PAC_INTFLAGC_REG_OFST          (0x1C)              /**< (PAC_INTFLAGC) Peripheral interrupt flag status - Bridge C Offset */
#define PAC_STATUSA_REG_OFST           (0x34)              /**< (PAC_STATUSA) Peripheral write protection status - Bridge A Offset */
#define PAC_STATUSB_REG_OFST           (0x38)              /**< (PAC_STATUSB) Peripheral write protection status - Bridge B Offset */
#define PAC_STATUSC_REG_OFST           (0x3C)              /**< (PAC_STATUSC) Peripheral write protection status - Bridge C Offset */
#define PAC_NONSECA_REG_OFST           (0x54)              /**< (PAC_NONSECA) Peripheral non-secure status - Bridge A Offset */
#define PAC_NONSECB_REG_OFST           (0x58)              /**< (PAC_NONSECB) Peripheral non-secure status - Bridge B Offset */
#define PAC_NONSECC_REG_OFST           (0x5C)              /**< (PAC_NONSECC) Peripheral non-secure status - Bridge C Offset */

